abrenilla/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'mail@gmail.com'
 LIMIT 1
INSERT INTO `users` (`full_name`, `email`, `password`, `role`, `phone`, `address`, `age`) VALUES ('kim', 'mail@gmail.com', '$2y$10$9ktCznv887yhM4GUIrStQu0pROriD7nuSfhGPQMoFmqCqhgdSdkfG', 'sk_official', '09505489986', 'trenti', '21')
---
    public function register()
    {
        $users = new UserModel();
        $email = $this->request->getPost('email');

        // Check if email already exists
        if ($users->where('email', $email)->first()) {
            return redirect()->back()->withInput()->with('toast_error', 'Email already registered.');
        }

        $data = [
            'full_name' => $this->request->getPost('full_name'),
            'email'     => $email,
            'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'      => $this->request->getPost('role'),
            'phone'     => $this->request->getPost('phone'),
            'address'   => $this->request->getPost('address'),
            'age'       => $this->request->getPost('age'),
        ];

        $users->save($data);

SELECT *
FROM `users`
WHERE `email` = 'parilla@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $users = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $users->where('email', $email)->first();