abrenilla/app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = '39'
INSERT INTO `network_logs` (`user_id`, `full_name`, `ip_address`, `mac_address`, `action`) VALUES ('39', 'jazz', '192.168.20.14', '00:0E:C6:06:47:DE', 'Accessed Barangay dashboard')
---
    protected function logNetworkActivity(string $action): void
    {
        $request = service('request');
        $session = session();

        $userId = $session->get('user_id') ?? null;

        // ✅ Fetch user's full name based on ID
        $userName = 'Unknown User';
        if ($userId) {
            $userModel = new UserModel();
            $user = $userModel->find($userId);
            $userName = $user['full_name'] ?? $userName;
        }

        $ip = $request->getIPAddress();
        $mac = $this->getMacAddress($ip);

        $logModel = new NetworkLogModel();
        $logModel->insert([
            'user_id'    => $userId,
            'full_name'  => $userName,
            'ip_address' => $ip,
            'mac_address'=> $mac,
            'action'     => $action,
        ]);