abrenilla/app/Controllers/Dashboard.php

SELECT *
FROM `milestones`
---
    public function sk()
    {
        $milestoneModel = new MilestoneModel();
        $milestones = $milestoneModel->findAll();

SELECT COUNT(*) AS `numrows` FROM `proposals`
SELECT COUNT(*) AS `numrows`
FROM `proposals`
WHERE `status` = 'Approved'
SELECT COUNT(*) AS `numrows`
FROM `proposals`
WHERE `status` = 'Pending'
SELECT *
FROM `proposals`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function barangay()
    {
        $proposalModel = new ProposalModel();

        $totalProposals = $proposalModel->countAll();
        $approvedCount = $proposalModel->where('status', 'Approved')->countAllResults();
        $pendingCount = $proposalModel->where('status', 'Pending')->countAllResults();
        $recentProposals = $proposalModel->orderBy('created_at', 'DESC')->limit(5)->find();