abrenilla/app/Controllers/NetworkLogController.php

    public function index()
    {
        $db = \Config\Database::connect();

        $logs = $db->table('network_logs')
            ->select('*')
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `network_logs`
ORDER BY `created_at` DESC