abrenilla/app/Models/SettingsModel.php

    public function getSetting($name)
    {
        return $this->where('name', $name)->first();
---
SELECT *
FROM `settings`
WHERE `name` = 'system_mode'
 LIMIT 1

    public function updateSetting($name, $value)
    {
        $setting = $this->where('name', $name)->first();
        if ($setting) {
            return $this->where('name', $name)->set(['value' => $value])->update();
---
SELECT *
FROM `settings`
WHERE `name` = 'system_mode'
 LIMIT 1
UPDATE `settings` SET `value` = 'maintenance'
WHERE `name` = 'system_mode'